renesas/fsp/ra/fsp/src/bsp/cmsis/Device/RENESAS/Include/R7FA0E107.h
        struct
        {
            __IOM uint8_t CKSEL : 1;   /*!< [0..0] ICLK Clock Source Select                                           */
            __IM uint8_t  CKST  : 1;   /*!< [1..1] ICLK Clock Source Status                                           */
            uint8_t             : 6;
        } ICLKSCR_b;
    };

    union
    {
        __IOM uint8_t OSMC;            /*!< (@ 0x00000824) Subsystem Clock Supply Mode Control Register               */

        struct
        {
            uint8_t                : 4;
            __IOM uint8_t WUTMMCK0 : 1; /*!< [4..4] Selection of the Operating Clock for the Realtime Clock,
                                         *   32-bit Interval Timer, Serial Interfaces UARTA0                           */
            uint8_t : 3;
        } OSMC_b;
    };
    __IM uint8_t  RESERVED9;
    __IM uint16_t RESERVED10[5];

    union
    {
        __IM uint8_t RESF;             /*!< (@ 0x00000830) Reset Control Flag Register                                */

        struct
        {
            __IM uint8_t LVIRF  : 1;   /*!< [0..0] Internal Reset Request by Voltage Detector (LVD0 or LVD1)          */
            uint8_t             : 1;
            __IM uint8_t RPERF  : 1;   /*!< [2..2] Internal Reset Request by RAM Parity Error                         */
            uint8_t             : 1;
            __IM uint8_t IWDTRF : 1;   /*!< [4..4] Internal Reset Request by Independent Watchdog Timer
                                        *   (IWDT)                                                                    */
            __IM uint8_t SWRF : 1;     /*!< [5..5] Internal Reset Request by Software Reset                           */
            uint8_t           : 2;
        } RESF_b;
    };

    union
    {
        __IOM uint8_t PORSR;           /*!< (@ 0x00000831) Power-On Reset Status Register                             */

        struct
        {
            __IOM uint8_t PORF : 1;    /*!< [0..0] Checking Occurrence of Power-on Reset                              */
            uint8_t            : 7;
        } PORSR_b;
    };
    __IM uint16_t RESERVED11[7];

    union
    {
        __IOM uint8_t LVD1CR;          /*!< (@ 0x00000840) Voltage Monitor 1 Circuit Control Register                 */

        struct
        {
            __IOM uint8_t LVD1V   : 5; /*!< [4..0] Voltage Detection 1 Level Select                                   */
            __IOM uint8_t IRQSEL  : 1; /*!< [5..5] Voltage Monitor 1 Interrupt Type Select                            */
            __IOM uint8_t LVD1SEL : 1; /*!< [6..6] Operation mode of LVD1                                             */
            __IOM uint8_t LVD1EN  : 1; /*!< [7..7] Enabling Operation of LVD1                                         */
        } LVD1CR_b;
    };

    union
    {
        __IOM uint8_t LVD1MKR;         /*!< (@ 0x00000841) Voltage Monitor 1 Circuit Mask Register                    */

        struct
        {
            __IOM uint8_t MK : 1;      /*!< [0..0] Specification of Whether to Enable or Disable Rewriting
                                        *   th LVD1CR Register                                                        */
            uint8_t : 7;
        } LVD1MKR_b;
    };
    __IM uint8_t RESERVED12;

    union
    {
        __IOM uint8_t LVD1SR;          /*!< (@ 0x00000843) Voltage Monitor 1 Circuit Status Register                  */

        struct
        {
            __IOM uint8_t DET : 1;     /*!< [0..0] Voltage Monitor 1 Voltage Variation Detection Flag                 */
            __IM uint8_t  MON : 1;     /*!< [1..1] Voltage Monitor 1 Signal Monitor Flag                              */
            uint8_t           : 6;
        } LVD1SR_b;
    };
    __IM uint16_t RESERVED13[14];

    union
    {
        __IOM uint16_t SBYCR;          /*!< (@ 0x00000860) Standby Control Register                                   */

        struct
        {
            uint16_t             : 7;
            __IOM uint16_t FLSTP : 1;  /*!< [7..7] Flash Mode in Sleep Mode or in Snooze Mode                         */
            __IOM uint16_t FWKUP : 1;  /*!< [8..8] Setting for Starting the High-speed On-chip Oscillator
                                        *   at the Times of Release from Software Standby Mode and
                                        *   of Transitions to Snooze Mode                                             */
            __IOM uint16_t RTCLPC : 1; /*!< [9..9] SOSC Setting in Software Standby Mode or in Snooze Mode            */
            uint16_t              : 5;
            __IOM uint16_t SSBY   : 1; /*!< [15..15] Software Standby Mode Select                                     */
        } SBYCR_b;
    };

    union
    {
        __IOM uint8_t PSMCR;           /*!< (@ 0x00000862) Power Save Memory Control Register                         */

        struct
        {
            __IOM uint8_t RAMSD : 2;   /*!< [1..0] Operating Mode of the RAM                                          */
            uint8_t             : 6;
        } PSMCR_b;
    };

    union
    {
        __IOM uint8_t SYOCDCR;         /*!< (@ 0x00000863) System Control OCD Control Register                        */

        struct
        {
            uint8_t             : 7;
            __IOM uint8_t DBGEN : 1;   /*!< [7..7] Debugger Enable bit                                                */
        } SYOCDCR_b;
    };
    __IM uint16_t RESERVED14[77];

    union
    {
        __IOM uint16_t PRCR;           /*!< (@ 0x000008FE) Protect Register                                           */

        struct
        {
            __IOM uint16_t PRC0 : 1;   /*!< [0..0] Enable writing to the registers related to the clock
                                        *   generation circuit                                                        */
            __IOM uint16_t PRC1 : 1;   /*!< [1..1] Enable writing to the registers related to the low power
                                        *   modes                                                                     */
            uint16_t            : 1;
            __IOM uint16_t PRC3 : 1;   /*!< [3..3] Enable writing to the registers related to the LVD                 */
            uint16_t            : 4;
            __OM uint16_t PRKEY : 8;   /*!< [15..8] PRC Key Code                                                      */
        } PRCR_b;
    };
    __IM uint16_t RESERVED15[385];

    union
    {
        __IOM uint16_t MSTPCRA;        /*!< (@ 0x00000C02) Module Stop Control Register A                             */

        struct
        {
            uint16_t               : 6;
            __IOM uint16_t MSTPA22 : 1; /*!< [6..6] DTC Module Stop                                                    */
            uint16_t               : 9;
        } MSTPCRA_b;
    };
} R_SYSTEM_Type;                        /*!< Size = 3076 (0xc04)                                                       */

/* =========================================================================================================================== */
/* ================                                           R_TAU                                           ================ */
/* =========================================================================================================================== */

/**
 * @brief Timer Array Unit (R_TAU)
 */

typedef struct                               /*!< (@ 0x400A2600) R_TAU Structure                                            */
{
    __IOM R_TAU_TDR0_Type TDR0[8];           /*!< (@ 0x00000000) Timer Data Registers 0[0..7]                               */
    __IM uint16_t         RESERVED[120];
    __IM uint16_t         TCR0[8];           /*!< (@ 0x00000100) Timer Counter Register 0[0..7]                             */

    union
    {
        __IOM uint16_t TMR0[8];              /*!< (@ 0x00000110) Timer Mode Register 0[0..7]                                */

        struct
        {
            __IOM uint16_t OPIRQ : 1;        /*!< [0..0] Setting of starting count and interrupt                            */
            __IOM uint16_t MD    : 3;        /*!< [3..1] Selection of operation mode at channel n                           */
            uint16_t             : 2;
            __IOM uint16_t CIS   : 2;        /*!< [7..6] Selection of TI0n pin input valid edge                             */
            __IOM uint16_t STS   : 3;        /*!< [10..8] Setting of start trigger or capture trigger of channel
                                              *   n                                                                         */
            __IOM uint16_t MASTER_SPLIT : 1; /*!< [11..11] Selection between using channel n independently or
                                              *   simultaneously with another channel (as a slave or master)                */
            __IOM uint16_t CCS : 1;          /*!< [12..12] Selection of counter clock (fTCLK) of channel n                  */
            uint16_t           : 1;
            __IOM uint16_t CKS : 2;          /*!< [15..14] Selection of operation clock (fMCK) of channel n                 */
        } TMR0_b[8];
    };

    union
    {
        __IM uint16_t TSR0[8];         /*!< (@ 0x00000120) Timer Status Register 0[0..7]                              */

        struct
        {
            __IM uint16_t OVF : 1;     /*!< [0..0] Counter overflow state of channel n                                */
            uint16_t          : 15;
        } TSR0_b[8];
    };

    union
    {
        __IM uint16_t TE0;             /*!< (@ 0x00000130) Timer Channel Enable Status Register 0                     */

        struct
        {
            __IM uint16_t TE : 8;      /*!< [7..0] Indication of operation enabled or stopped state of channel
                                        *   n                                                                         */
            uint16_t           : 1;
            __IM uint16_t TEH1 : 1;    /*!< [9..9] Indication of whether operation of the higher 8-bit timer
                                        *   is enabled or stopped when channel 1 is in the 8-bit timer
                                        *   mode                                                                      */
            uint16_t           : 1;
            __IM uint16_t TEH3 : 1;    /*!< [11..11] Indication of whether operation of the higher 8-bit
                                        *   timer is enabled or stopped when channel 3 is in the 8-bit
                                        *   timer mode                                                                */
            uint16_t : 4;
        } TE0_b;
    };

    union
    {
        __IOM uint16_t TS0;            /*!< (@ 0x00000132) Timer Channel Start Register 0                             */

        struct
        {
            __IOM uint16_t TS   : 8;   /*!< [7..0] Operation enable (start) trigger of channel n                      */
            uint16_t            : 1;
            __IOM uint16_t TSH1 : 1;   /*!< [9..9] Trigger to enable operation (start operation) of the
                                        *   higher 8-bit timer when channel 1 is in the 8-bit timer
                                        *   mode                                                                      */
            uint16_t            : 1;
            __IOM uint16_t TSH3 : 1;   /*!< [11..11] Trigger to enable operation (start operation) of the
                                        *   higher 8-bit timer when channel 3 is in the 8-bit timer
                                        *   mode                                                                      */
            uint16_t : 4;
        } TS0_b;
    };

    union
    {
        __IOM uint16_t TT0;            /*!< (@ 0x00000134) Timer Channel Stop Register 0                              */

        struct
        {
            __IOM uint16_t TT   : 8;   /*!< [7..0] Operation stop trigger of channel n                                */
            uint16_t            : 1;
            __IOM uint16_t TTH1 : 1;   /*!< [9..9] Trigger to stop operation of the higher 8-bit timer when
                                        *   channel 1 is in the 8-bit timer mode                                      */
            uint16_t            : 1;
            __IOM uint16_t TTH3 : 1;   /*!< [11..11] Trigger to stop operation of the higher 8-bit timer
                                        *   when channel 3 is in the 8-bit timer mode                                 */
            uint16_t : 4;
        } TT0_b;
    };

    union
    {
        __IOM uint16_t TPS0;           /*!< (@ 0x00000136) Timer Clock Select Register 0                              */

        struct
        {
            __IOM uint16_t PRS0 : 4;   /*!< [3..0] Selection of operation clock (CK00)                                */
            __IOM uint16_t PRS1 : 4;   /*!< [7..4] Selection of operation clock (CK01)                                */
            __IOM uint16_t PRS2 : 2;   /*!< [9..8] Selection of operation clock (CK02)                                */
            uint16_t            : 2;
            __IOM uint16_t PRS3 : 2;   /*!< [13..12] Selection of operation clock (CK03)                              */
            uint16_t            : 2;
        } TPS0_b;
    };

    union
    {
        __IOM uint16_t TO0;            /*!< (@ 0x00000138) Timer Output Register 0                                    */

        struct
        {
            __IOM uint16_t TO : 8;     /*!< [7..0] Timer output of channel n                                          */
            uint16_t          : 8;
        } TO0_b;
    };

    union
    {
        __IOM uint16_t TOE0;           /*!< (@ 0x0000013A) Timer Output Enable Register 0                             */

        struct
        {
            __IOM uint16_t TOE : 8;    /*!< [7..0] Enabling or disabling timer output for channel n                   */
            uint16_t           : 8;
        } TOE0_b;
    };

    union
    {
        __IOM uint16_t TOL0;           /*!< (@ 0x0000013C) Timer Output Level Register 0                              */

        struct
        {
            uint16_t           : 1;
            __IOM uint16_t TOL : 7;    /*!< [7..1] Control of timer output of channel n                               */
            uint16_t           : 8;
        } TOL0_b;
    };

    union
    {
        __IOM uint16_t TOM0;           /*!< (@ 0x0000013E) Timer Output Mode Register 0                               */

        struct
        {
            uint16_t           : 1;
            __IOM uint16_t TOM : 7;    /*!< [7..1] Control of timer output mode of channel n                          */
            uint16_t           : 8;
        } TOM0_b;
    };
} R_TAU_Type;                          /*!< Size = 320 (0x140)                                                        */

/* =========================================================================================================================== */
/* ================                                           R_TML                                           ================ */
/* =========================================================================================================================== */

/**
 * @brief 32-bit Interval Timer (R_TML)
 */

typedef struct                         /*!< (@ 0x400A3800) R_TML Structure                                            */
{
    union
    {
        __IOM uint16_t ITLCMP00;       /*!< (@ 0x00000000) Interval Timer Compare Registers 00                        */

        struct
        {
            __IOM uint8_t ITLCMP00_L;  /*!< (@ 0x00000000) Interval Timer Compare Registers 00                        */
            __IOM uint8_t ITLCMP00_H;  /*!< (@ 0x00000001) Interval Timer Compare Registers 00                        */
        };
    };

    union
    {
        __IOM uint16_t ITLCMP01;       /*!< (@ 0x00000002) Interval Timer Compare Registers 01                        */

        struct
        {
            __IOM uint8_t ITLCMP01_L;  /*!< (@ 0x00000002) Interval Timer Compare Registers 01                        */
            __IOM uint8_t ITLCMP01_H;  /*!< (@ 0x00000003) Interval Timer Compare Registers 01                        */
        };
    };
    __IM uint16_t ITLCAP00;            /*!< (@ 0x00000004) Interval Timer Capture Register 00                         */

    union
    {
        __IOM uint8_t ITLCTL0;         /*!< (@ 0x00000006) Interval Timer Control Register                            */

        struct
        {
            __IOM uint8_t EN0 : 1;     /*!< [0..0] 8-bit Counter Mode: ITL000 Count Enable                            */
            __IOM uint8_t EN1 : 1;     /*!< [1..1] 8-bit Counter Mode: ITL001 Count Enable                            */
            __IOM uint8_t EN2 : 1;     /*!< [2..2] 8-bit Counter Mode: ITL012 Count Enable                            */
            __IOM uint8_t EN3 : 1;     /*!< [3..3] 8-bit Counter Mode: ITL013 Count Enable                            */
            uint8_t           : 2;
            __IOM uint8_t MD  : 2;     /*!< [7..6] Selection of 8-bit, 16-bit, or 32-bit Counter Mode                 */
        } ITLCTL0_b;
    };

    union
    {
        __IOM uint8_t ITLCSEL0;        /*!< (@ 0x00000007) Interval Timer Clock Select Register 0                     */

        struct
        {
            __IOM uint8_t ISEL : 3;    /*!< [2..0] Selection of Interval Timer Count Clock (fITL0)                    */
            uint8_t            : 1;
            __IOM uint8_t CSEL : 3;    /*!< [6..4] Selection of Interval Timer Count Clock for Capturing
                                        *   (fITL1)                                                                   */
            uint8_t : 1;
        } ITLCSEL0_b;
    };

    union
    {
        __IOM uint8_t ITLFDIV00;       /*!< (@ 0x00000008) Interval Timer Frequency Division Register 0               */

        struct
        {
            __IOM uint8_t FDIV0 : 3;   /*!< [2..0] 8-bit Counter Mode: Counter Clock for ITL000                       */
            uint8_t             : 1;
            __IOM uint8_t FDIV1 : 3;   /*!< [6..4] 8-bit Counter Mode: Counter Clock for ITL001                       */
            uint8_t             : 1;
        } ITLFDIV00_b;
    };

    union
    {
        __IOM uint8_t ITLFDIV01;       /*!< (@ 0x00000009) Interval Timer Frequency Division Register 1               */

        struct
        {
            __IOM uint8_t FDIV2 : 3;   /*!< [2..0] 8-bit Counter Mode: Counter Clock for ITL012                       */
            uint8_t             : 1;
            __IOM uint8_t FDIV3 : 3;   /*!< [6..4] 8-bit Counter Mode: Counter Clock for ITL013                       */
            uint8_t             : 1;
        } ITLFDIV01_b;
    };

    union
    {
        __IOM uint8_t ITLCC0;          /*!< (@ 0x0000000A) Interval Timer Capture Control Register 0                  */

        struct
        {
            __IOM uint8_t CTRS   : 2;  /*!< [1..0] Selection of Capture Trigger                                       */
            uint8_t              : 1;
            __IOM uint8_t CAPCCR : 1;  /*!< [3..3] Selection of Capture Counter Clearing After Capturing              */
            __IOM uint8_t CAPR   : 1;  /*!< [4..4] Software Capture Trigger                                           */
            __IM uint8_t  CAPF   : 1;  /*!< [5..5] Capture Completion Flag                                            */
            __IOM uint8_t CAPFCR : 1;  /*!< [6..6] Capture Completion Flag Clear                                      */
            __IOM uint8_t CAPEN  : 1;  /*!< [7..7] Capture Enable                                                     */
        } ITLCC0_b;
    };

    union
    {
        __IOM uint8_t ITLS0;           /*!< (@ 0x0000000B) Interval Timer Status Register                             */

        struct
        {
            __IOM uint8_t ITF00 : 1;   /*!< [0..0] Compare Match Detection Flag for Channel 0                         */
            __IOM uint8_t ITF01 : 1;   /*!< [1..1] Compare Match Detection Flag for Channel 1                         */
            __IOM uint8_t ITF02 : 1;   /*!< [2..2] Compare Match Detection Flag for Channel 2                         */
            __IOM uint8_t ITF03 : 1;   /*!< [3..3] Compare Match Detection Flag for Channel 3                         */
            __IOM uint8_t ITF0C : 1;   /*!< [4..4] Capture Detection Flag                                             */
            uint8_t             : 3;
        } ITLS0_b;
    };

    union
    {
        __IOM uint8_t ITLMKF0;         /*!< (@ 0x0000000C) Interval Timer Match Detection Mask Register               */

        struct
        {
            __IOM uint8_t MKF00 : 1;   /*!< [0..0] Mask for Compare Match Status Flag for Channel 0                   */
            __IOM uint8_t MKF01 : 1;   /*!< [1..1] Mask for Compare Match Status Flag for Channel 1                   */
            __IOM uint8_t MKF02 : 1;   /*!< [2..2] Mask for Compare Match Status Flag for Channel 2                   */
            __IOM uint8_t MKF03 : 1;   /*!< [3..3] Mask for Compare Match Status Flag for Channel 3                   */
            __IOM uint8_t MKF0C : 1;   /*!< [4..4] Mask for Capture Detection Status Flag                             */
            uint8_t             : 3;
        } ITLMKF0_b;
    };
    __IM uint8_t  RESERVED;
    __IM uint16_t RESERVED1;
} R_TML_Type;                          /*!< Size = 16 (0x10)                                                          */

/* =========================================================================================================================== */
/* ================                                          R_TRNG                                           ================ */
/* =========================================================================================================================== */

/**
 * @brief True Random Number Generator (R_TRNG)
 */

typedef struct                         /*!< (@ 0x400D1000) R_TRNG Structure                                           */
{
    union
    {
        __IM uint8_t TRNGSDR;          /*!< (@ 0x00000000) TRNG SEED Data Register                                    */

        struct
        {
            __IM uint8_t SDATA : 8;    /*!< [7..0] When RDRDY bit is 1, these bits hold the generated SEED.
                                        *   When RDRDY bit is 0, these bits are read as 00h.The SEED
                                        *   is generated as 32-bit data. When TRNGSDR is read 4 times
                                        *   while RDRDY = 1, SEED reading is completed and RDRDY bit
                                        *   changes to 0                                                              */
        } TRNGSDR_b;
    };
    __IM uint8_t RESERVED;

    union
    {
        __IOM uint8_t TRNGSCR0;        /*!< (@ 0x00000002) TRNG SEED Command Register 0                               */

